teaching/amiga/index.html
---
layout: page
title: Amiga Assembler Tutorial
---

<p>
This tutorial is aimed at people who are interested in starting to program the Commodore Amiga. As we want to understand a computer and not a programming language and as we want to write as efficient code as possible we will code in assembler. You are not expected to know assembler before we start and we will go through everything that you need. If you need a reason to take this tutorial 
</p>

<div id="outline-container-orgcce709d" class="outline-2">
<h2 id="orgcce709d">Introduction to the Commodore Amiga</h2>
<div class="outline-text-2" id="text-orgcce709d">
<dl class="org-dl">
<dt>History</dt><dd>How did the Amiga Come about?</dd>
<dt>Structure</dt><dd>What is the intention of this?</dd>
<dt>Environment</dt><dd>We will set-up a virtual development environment that we can run our code in. You will see how AmigaOS works.</dd>
</dl>
</div>
</div>
<div id="outline-container-orga938836" class="outline-2">
<h2 id="orga938836">Motorola 680x0</h2>
<div class="outline-text-2" id="text-orga938836">
<dl class="org-dl">
<dt>Strucutre</dt><dd>How is the Amiga hardware structured?</dd>
<dt>680x0 ASM</dt><dd>We will go through the basics needed to program 680x0 assembler, the instructions that we need, the flags/conditions and the different addressing modes. I doubt there is a nicer CPU to program then the 680x0 architecture especially if you are coming from the x86 world.</dd>
<dt>AsmOne</dt><dd>We will use the integrated assembler <a href="http://www.tfa.org/documents/asmone.html">Asm-One</a> as our development environment, it is very useful as it has built in debugger and monitor.</dd>
</dl>
</div>
</div>
<div id="outline-container-org5d0bec2" class="outline-2">
<h2 id="org5d0bec2">The Chipset</h2>
<div class="outline-text-2" id="text-org5d0bec2">
<p>
Now we have gathered the tools to be able to start exploring the chips that makes the Amiga such a unique platform. We will begin by looking at how we can set-up a screen.
</p>
<dl class="org-dl">
<dt>Startup code</dt><dd>How is a screen set-up and how to we take control from the OS to <span class="underline">rule</span> the machine ourselves</dd>
<dt>Copper</dt><dd>We will look at the first co-processor in the chips-set the famous <i>copper</i>. The aim is to be able to set-up a stable screen and get interupts from the beam.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgbd85f54" class="outline-2">
<h2 id="orgbd85f54">Effects</h2>
<div class="outline-text-2" id="text-orgbd85f54">
<p>
In this session we will look at how we can start writing some simple effects using only the copper and the CPU. We will also look at some demos and try to see how things have been done.
</p>
</div>
</div>
<div id="outline-container-orgcd777c8" class="outline-2">
<h2 id="orgcd777c8">Demo</h2>
<div class="outline-text-2" id="text-orgcd777c8">
<p>
In this last session we will summarise what we have looked at and where to go next. What is needed to create your own demo.
</p>
</div>
<div id="outline-container-org6b0991c" class="outline-3">
<h3 id="org6b0991c">The player</h3>
<div class="outline-text-3" id="text-org6b0991c">
<p>
In this tutorial we have focused on graphics but the Amiga has quite a good sound chip as well. Referred to as Paula she can play sampled music in 4-chanels (or voices) and even though she doesn't have as characteristic sounds as the YM or the SID chip of she can still be recognised mainly due to the tracker-style music that was developed on her. Sadly we do not have time to discuss Paula in detail but we will set-up a minimal system and look at how we can time effects to music.
</p>
</div>
</div>
<div id="outline-container-org655fc8e" class="outline-3">
<h3 id="org655fc8e">Chunky-to-Planar</h3>
<div class="outline-text-3" id="text-org655fc8e">
<p>
Some effects are really tricky to write in Bitplane mode as it requires lots of masking and adressing in order to be able to write a single pixel. Therefore it is sometimes desirable to have a <i>chunky</i> screen instead, i.e. a scree where you can adress each 8-bit pixel individually. To do so we can use a Chunky-to-Planar converter or a <b>c2p</b>. The calculations to perform this conversion is rather hefty to we can only use this on rather fast machines, 030 and upwards.
</p>
</div>
</div>
</div>
